app/Controllers/Home.php

SELECT *
FROM `product`
---
    public function index(): string
    {
        $product = $this->product->findAll();